/*******************************************************Copyright*********************************************************
**                                            北京博创兴盛机器人技术有限公司
**                                                       研发部
**                                               http://robot.up-tech.com
**
**-------------------------------------------------------文件信息---------------------------------------------------------
** 文件名称:			SystemInit.c
** 最后修订日期:  	2009-10-09
** 最后版本:			1.0
** 描述:				系统服务初始化
**
**------------------------------------------------------------------------------------------------------------------------
** 创建人:			律晔
** 创建日期:			2009-10-09
** 版本:				1.0
** 描述:				系统服务初始化
**
**------------------------------------------------------------------------------------------------------------------------
** 修订人:
** 修订日期:
** 版本:
** 描述:
**
**------------------------------------------------------------------------------------------------------------------------
** 修订人:
** 修订日期:
** 版本:
** 描述:
**
*************************************************************************************************************************/
#include "Apps/SystemInit.h"


/*************************************************************************************************************************
** 函数名称:			InitClkSys
**
** 函数描述:			系统时钟初始化
**
**
** 输入变量:			void;
** 返回值:			void;
**
** 使用宏或常量:		None;
** 使用全局变量:		None;
**
** 调用函数:			None;
**
** 创建人:			律晔
** 创建日期:			2010-04-12
**------------------------------------------------------------------------------------------------------------------------
** 修订人:
** 修订日期:
**------------------------------------------------------------------------------------------------------------------------
*************************************************************************************************************************/
void InitClkSys(void)
{
	/* Enable for external 2-9 MHz crystal with quick startup time
	 * (256CLK). Check if it's stable and set the external
	 * oscillator as the main clock source.
	 */
	CLKSYS_XOSC_Config( OSC_FRQRANGE_2TO9_gc,
						false,
						OSC_XOSCSEL_EXTCLK_gc );
	CLKSYS_Enable( OSC_XOSCEN_bm );
	do {} while ( CLKSYS_IsReady( OSC_XOSCRDY_bm ) == 0 );

	/*  Configure PLL with the external 2-9 MHz crystal as source and
	 *  multiply by 8 to get 64 MHz PLL clock and enable it. Wait
	 *  for it to be stable and set prescaler C to divide by two
	 *  to set the CPU clock to 32 MHz. Disable unused clock.
	 */
	CLKSYS_PLL_Config( OSC_PLLSRC_XOSC_gc, 8 );
	CLKSYS_Enable( OSC_PLLEN_bm );
	CLKSYS_Prescalers_Config( CLK_PSADIV_1_gc, CLK_PSBCDIV_1_2_gc );
	do {} while ( CLKSYS_IsReady( OSC_PLLRDY_bm ) == 0 );
	CLKSYS_Main_ClockSource_Select( CLK_SCLKSEL_PLL_gc );
	CLKSYS_Disable( OSC_XOSCEN_bm );
}


/*************************************************************************************************************************
** 函数名称:			InitDevices
**
** 函数描述:			全系统设备初始化
**
**
** 输入变量:			void;
** 返回值:			void;
**
** 使用宏或常量:		None;
** 使用全局变量:		None;
**
** 调用函数:			None;
**
** 创建人:			律晔
** 创建日期:			2010-04-12
**------------------------------------------------------------------------------------------------------------------------
** 修订人:
** 修订日期:
**------------------------------------------------------------------------------------------------------------------------
*************************************************************************************************************************/
void InitDevices(void)
{
	cli();

	InitClkSys();

	/* 用于四分屏器控制，MCU_Image */
	InitUsartC0(19200);

	/* 用于设备总线控制，MCU_ARM */
	InitUsartC1(4800);

	/* 用于左电机驱动控制，MCU_ML */
	InitUsartD0(19200);

	/* 用于右电机驱动控制，MCU_MR */
	InitUsartD1(19200);

	/* 用于无线控制，MCU_RC  */
	InitUsartE0(19200);

	/* 用于有线控制, MCU_RC1 */
	InitUsartE1(19200);

	/* 用于外接串行控制， MCU_EX */
	InitUsartF0(19200);

	/* 用于串行数据接收控制 */
	InitTCD0();

	/* 用于无线传输，发送延时控制 */
	InitTCD1();


	/* Enable all interrupt levels. */
	PMIC_SetVectorLocationToApplication();
	PMIC_EnableLowLevel();
	PMIC_EnableMediumLevel();
	PMIC_EnableHighLevel();

	/**********指示灯操作**************/
	PORTE.DIRSET  = PIN4_bm;
	PORTE.OUTCLR  = PIN4_bm;

	PORTE.DIRSET  = PIN5_bm;
	PORTE.OUTCLR  = PIN5_bm;

	/* 设备总线的RS485发送端控制，设置输出，并使能无效 */
	PORTC.DIRSET  = PIN1_bm;
	PORTC.OUTCLR  = PIN1_bm;

	/* 有线控制的RS485发送端控制，设置输出，并使能无效 */
	PORTE.DIRSET  = PIN1_bm;
	PORTE.OUTCLR  = PIN1_bm;

	/* Enable global interrupts. */
	sei();
}


/*************************************************************************************************************************
**														结构体声明
*************************************************************************************************************************/


/*************************************************************************************************************************
**                                                      文件结束
*************************************************************************************************************************/
